{
	"intro": "intro text",
	"pre_problem_1": "You sit down at your company issued computer and see your first task from Chert: display a short message saying hello to him on the terminal. He says he wants it done in Python. What is python you ask yourself? Luckily, your mysterious ai usb stick genie friend has an explanation for you:\nAlright! Let’s imagine Python like learning how to talk to a robot—one that listens really well and does exactly what you say.\nWhat Is Python?\nPython is a programming language. Think of it like a set of instructions you write for a computer so it can do something—like solve a math problem, draw a picture, or check the weather.\nIf computers are super smart assistants, then Python is the language you use to give them clear directions.\n\nWhy Is It Called “Python”?\nFun fact—it’s not named after the snake! The creator of Python was a fan of the comedy group Monty Python, so he picked a fun name to go along with a fun language.\nWhat Can Python Do?\nPython is used to:\n- Make websites\n- Build apps and games\n- Control robots\n- Analyze data (like for science or business)\n- Automate boring stuff (like renaming 1,000 files with one click\nWhat Makes Python Great for Beginners?\n- It looks like English!\n- Instead of weird symbols or complex code, Python uses simple words.\n- It's forgiving.\n- You can mess up a bit and still get stuff to work.\n- Huge community.\n- Tons of tutorials, help, and free tools online.\nAwesome stuff, thank you genie. Now you need to figure out how to print to the terminal. Here is a quick rundown of the function you’ll need to complete your first task:\n\nWhat Is a Function?\n\nThink of a function like a tool or a machine.\nIf you had a blender, you'd put in fruit and press a button—and it gives you a smoothie. A function works the same way: you give it something, and it does something with it.\nSo What’s print()?\nprint() is a built-in function in Python. That means Python already knows what it does—you don’t have to build it yourself.\nIt’s like a robot that says:\"Whatever you give me, I’ll show it on the screen.\"\nLet’s Look at This Line:\nprint(\"Hello, world!\")\nBreakdown:\n\nPrint = the name of the function, telling the computer to call the print robot\n() = parentheses to hold the information you want to print\n\"Hello, world!\" = The text you’re telling the print robot to display.\nFeel free to check back here if you need to review this info while working on the problem!",
	"post_problem_1": "post1 text",
	"pre_problem_2": "Chert passed you his next task: label if an email is urgent or not by printing a message depending on the email status to the terminal. How do we check what the status of the email is and print out the right message? If statements are the answer. Your Debug Djinn has an explanation for you:\n\nWhat Is an If Statement?\nImagine you're telling your computer:\n\"Hey, if this happens, do this. Otherwise, maybe do something else.\"\nIt’s just like how we make decisions in real life.\nThe Basics:\nIf condition:\nDo_this\nelif another_condition:\nDo_other_thing\nelse:\ndo_this_if_nothing_matched\nExample:\nHungry = True\nif Hungry:\nprint(“Time to eat!”)\nelse:\nprint(“Not time to eat.”)",
	"post_problem_2": "post2 text",
	"pre_problem_3": "For loops in Python let you repeat actions a certain number of times. Imagine you have a list of things—like fruits—and you want to say each one out loud. A for loop helps you do that! Example: for fruit in ['apple', 'banana', 'cherry']: print(fruit). This goes through the list one item at a time and prints each fruit. The loop stops when it reaches the end of the list. It's like telling the computer: 'For each thing in this group, do this action.'",
	"post_problem_3": "post 3 text",
	"pre_problem_4": "You can use a for loop and an if statement together to check each item in a list and only do something if it meets a condition. For example: for number in [1, 2, 3, 4, 5]: if number % 2 == 0: print(number). This loop goes through each number and only prints it if it's even. The for loop handles going through the list, and the if statement decides whether or not to take action for each item.",
	"post_problem_4": "post 4 text",
	"pre_problem_5": "Bubble Sort works by comparing two numbers at a time and swapping them if they are in the wrong order. It keeps doing this over and over, going through the list again and again, until everything is sorted. Think of it like bubbles in water—bigger numbers 'bubble up' to the top (end of the list) each round.",
	"post_problem_5": "post 5 text",
	"conclusion": "Conclusion Text"
}
