{
	"intro": "Welcome to Chert Corp! You’ve just been hired on as a new junior dev and you’re excited to start your new job!... Unfortunately, you actually have no clue what you’re doing and piggy backed off of all of your teammates throughout college. Luckily for you, you happened to accidentally free a mischievous, ancient genie trapped inside a dusty, cursed USB stick you found at a garage sale labeled \"senior_dev_finalFINALv7.zip\".
Now bound to you, the Debug Djinn (who insists he's not AI, but rather a \"Code Spirit from the Fifth Layer of Stack Overflow\") must help you survive your new job as a Python developer, despite your complete lack of qualifications.",
	"pre_problem_1": "You sit down at your company issued computer and see your first task from Chert: display a short message saying hello to him on the terminal. He says he wants it done in Python. What is python you ask yourself? Luckily, your mysterious ai usb stick genie friend has an explanation for you:\nAlright! Let’s imagine Python like learning how to talk to a robot—one that listens really well and does exactly what you say.\nWhat Is Python?\nPython is a programming language. Think of it like a set of instructions you write for a computer so it can do something—like solve a math problem, draw a picture, or check the weather.\nIf computers are super smart assistants, then Python is the language you use to give them clear directions.\n\nWhy Is It Called “Python”?\nFun fact—it’s not named after the snake! The creator of Python was a fan of the comedy group Monty Python, so he picked a fun name to go along with a fun language.\nWhat Can Python Do?\nPython is used to:\n- Make websites\n- Build apps and games\n- Control robots\n- Analyze data (like for science or business)\n- Automate boring stuff (like renaming 1,000 files with one click\nWhat Makes Python Great for Beginners?\n- It looks like English!\n- Instead of weird symbols or complex code, Python uses simple words.\n- It's forgiving.\n- You can mess up a bit and still get stuff to work.\n- Huge community.\n- Tons of tutorials, help, and free tools online.\nAwesome stuff, thank you genie. Now you need to figure out how to print to the terminal. Here is a quick rundown of the function you’ll need to complete your first task:\n\nWhat Is a Function?\n\nThink of a function like a tool or a machine.\nIf you had a blender, you'd put in fruit and press a button—and it gives you a smoothie. A function works the same way: you give it something, and it does something with it.\nSo What’s print()?\nprint() is a built-in function in Python. That means Python already knows what it does—you don’t have to build it yourself.\nIt’s like a robot that says:\"Whatever you give me, I’ll show it on the screen.\"\nLet’s Look at This Line:\nprint(\"Hello, world!\")\nBreakdown:\n\nPrint = the name of the function, telling the computer to call the print robot\n() = parentheses to hold the information you want to print\n\"Hello, world!\" = The text you’re telling the print robot to display.\nFeel free to check back here if you need to review this info while working on the problem!",
	"post_problem_1":  "Ahhh… the sacred words echo once more across the silicon sands: \"Hello, world!\"\nA rite as old as time… or at least as old as Python 1.0.\n\nYou have summoned the print incantation successfully, fledgling developer.\nThe console responded, and the void did not scream. Well done!\n\nBut do not get cocky. This was but a whisper of true power.\nAhead lie wild loops, cursed errors, and a most diabolical foe: *indentation*.\n\nStill, take a moment to bask in the glow of your first output.\nChert is pleased... for now.\n\nOnward, apprentice. The next trial awaits.",
	"pre_problem_2": "Chert passed you his next task: label if an email is urgent or not by printing a message depending on the email status to the terminal. How do we check what the status of the email is and print out the right message? If statements are the answer. Your Debug Djinn has an explanation for you:\n\nWhat Is an If Statement?\nImagine you're telling your computer:\n\"Hey, if this happens, do this. Otherwise, maybe do something else.\"\nIt’s just like how we make decisions in real life.\nThe Basics:\nIf condition:\nDo_this\nelif another_condition:\nDo_other_thing\nelse:\ndo_this_if_nothing_matched\nExample:\nHungry = True\nif Hungry:\nprint(“Time to eat!”)\nelse:\nprint(“Not time to eat.”)",
	"post_problem_2": "Aha! The flames of logic flicker brightly in you, apprentice!\nYou’ve peered into the sacred variable and made a judgment call — correctly so.\nWhen the email screamed \"URGENT\", your code rose to the occasion like a phoenix wearing a necktie.\n\nYour if-statement has passed the test... for now.\nBut beware! There are greater beasts ahead: elifs, elses... and the dreaded nested condition.\n\nStill, Chert remains blissfully unaware of your bluff. Well done.",
	"pre_problem_3": "For loops in Python let you repeat actions a certain number of times. Imagine you have a list of things—like fruits—and you want to say each one out loud. A for loop helps you do that! Example: for fruit in ['apple', 'banana', 'cherry']: print(fruit). This goes through the list one item at a time and prints each fruit. The loop stops when it reaches the end of the list. It's like telling the computer: 'For each thing in this group, do this action.'",
	"post_problem_3": "Ahhh, the ritual of repetition — you've invoked the for loop spell with elegance.\nFive reminders, just as Chert ordered. Five sacred chants to summon punctuality!\n\nThe loop obeys you now... but loops are like fire. Useful. Dangerous. Sometimes infinite.\n\nTake pride, apprentice — you're one step closer to convincing your boss you're a real developer.\n\nJust... don’t forget to actually attend that standup.",
	"pre_problem_4": "You can use a for loop and an if statement together to check each item in a list and only do something if it meets a condition. For example: for number in [1, 2, 3, 4, 5]: if number % 2 == 0: print(number). This loop goes through each number and only prints it if it's even. The for loop handles going through the list, and the if statement decides whether or not to take action for each item.",
	"post_problem_4": "You have combed through the scroll of server statuses and shouted warnings into the void.\nThe Debug Djinn approves — not because you are skilled, but because you are lucky.\n\nYou handled the list like a seasoned sysadmin (or at least someone who has read half a tutorial).\n\nEach 'Offline' was met with swift alarm. Beautiful. Efficient. Slightly terrifying.\n\nThe servers may be down, but your journey continues upward!",
	"pre_problem_5": "Bubble Sort works by comparing two numbers at a time and swapping them if they are in the wrong order. It keeps doing this over and over, going through the list again and again, until everything is sorted. Think of it like bubbles in water—bigger numbers 'bubble up' to the top (end of the list) each round.",
	"post_problem_5": "You... sorted the todo list.\nBy the swirling sands of spaghetti code, I didn't think you'd pull it off!\n\nYou've wrangled chaos into order using... *a loop*. And maybe... just maybe... a bubble sort spell whispered to you in haste.\n\nChert thinks you're brilliant. The fool.\n\nBut I, the Debug Djinn, know the truth: you are a delightful liar armed with parentheses and hustle.\n\nCome — let us continue the deception!",
	"conclusion": "By the blazing LEDs of Mount Stacktrace… you did it.\n\nYou, who once gazed blankly at the terminal, have conquered loops, tamed logic, and sorted chaos itself.\nYou’ve bamboozled Chert, bent Python to your will, and—through sheer determination and questionable competence—survived your first week as a dev.\n\nThe Debug Djinn is... begrudgingly impressed.\n\nBut remember, apprentice: this was only the beginning. Beyond Chert’s cubicle lies a world of legacy code, merge conflicts, and interns who think JavaScript is a database.\n\nAnd yet, if you ever feel lost again… simply summon me.\nFor I am bound to you... until someone unplugs the USB.\n\nNow go forth, junior developer — and may your code always compile on the first try (lol)."
}
